tap 'jorgelbg/tap'
tap 'facebook/fb'

cask_args appdir: '~/Applications'

cask 'vlc'
cask 'alacritty'
cask 'telegram'
cask 'google-chrome'
cask 'obsidian'
cask 'figma'
cask 'visual-studio-code'
cask 'insomnia'
cask 'slack'
cask 'discord'
cask 'zulu@17'
cask 'calibre'
cask 'chatgpt'
cask 'icon-composer'
cask 'chatgpt'
cask 'claude'
cask 'font-0xproto-nerd-font'

# --- Shared across machine users

cask 'qbittorrent', args: { appdir: '/Applications' }
cask 'maintenance', args: { appdir: '/Applications' }

# --- Brews

brew 'nvm'
brew 'eza'
brew 'tmux'
brew 'nvim'
brew 'mas'
brew 'watchman'
brew 'rbenv'
brew 'pyenv'
brew 'jenv'
brew 'ruby-build'
brew 'nmap'
brew 'ios-deploy'
brew 'htop'
brew 'flyctl'
brew 'zsh-autosuggestions'
brew 'fzf'
brew 'doctl'
brew 'gnupg'
brew 'facebook/fb/idb-companion'
brew 'apktool' # unzip and decompile android apk
brew 'jadx' # lool up inside android apk. jadx-gui available after installation
brew 'httpie'
brew 'ipmitool'
brew 'scrcpy'
brew 'unar'
brew 'git-flow'
brew 'neofetch'
brew 'pnpm'
brew 'typewritten'

# mas 'Xcode', id: 497799835
